openbouffalo/bouffalo_sdk_bl808/bsp/common/lcd/mipi_dbi/bl_mipi_dbi.c
#include "../lcd.h"

#if (defined(LCD_DBI_INTERFACE_TYPE) && (LCD_DBI_INTERFACE_TYPE == 1))

#if (__has_include("bflb_dbi.h"))

#include "bl_mipi_dbi.h"
#include "bflb_dbi.h"
#include "bflb_dma.h"
#include "bflb_gpio.h"
#include "bflb_l1c.h"

#if defined(BL606P) || defined(BL628) || defined(BL702L) || defined(BL702) || defined(BL808)
#include "board.h"
#else
#include "board_gpio.h"
#endif

#if defined(BL808)
#include "bl808_glb.h"
#endif

#if ((LCD_DBI_WORK_MODE == 4) && (DBI_QSPI_SUPPORT == 0))
#error : "The DBI of this chip does not support QSPI mode."
#endif

#define LCD_DBI_DMA_LLI_NUM (DBI_DBI_DATA_SIZE_MAX / 4 / 4064 + 1)

/* clock frequency limit */
#if (defined(BL616L) || defined(BL616D) || defined(BL808))
/* Bus clock: 160M (BL808: mm muxpll 160m) */
#if (LCD_DBI_WORK_MODE == 3) /* typeB */
#define LCD_DBI_CLOCK_LIMIT (54 * 1000 * 1000)
#else /* typeC/QSPI */
#define LCD_DBI_CLOCK_LIMIT (80 * 1000 * 1000)
#endif
#else
/* Bus clock: 80M */
#if (LCD_DBI_WORK_MODE == 3) /* typeB */
#define LCD_DBI_CLOCK_LIMIT (27 * 1000 * 1000)
#else /* typeC/QSPI */
#define LCD_DBI_CLOCK_LIMIT (40 * 1000 * 1000)
#endif
#endif

/* asynchronous flush interrupt callback */
typedef void (*dbi_callback)(void);
static volatile dbi_callback dbi_async_callback = NULL;
static volatile bool dbi_async_callback_en_flag = true;

/* dma device */
static struct bflb_device_s *dbi_dma_hd;
/* pec dbi typeB device */
static struct bflb_device_s *dbi_hd;

#if defined(BL808)
/*
 * The BL808 DBI lives in the multimedia clock/reset domain.  Before the
 * LHAL driver touches the peripheral the 160 MHz mm clock must be enabled,
 * the MIPI/display block reset and, in Type C mode, the GPIO function-23
 * group routed to the Type C pads.
 */
static void bl808_dbi_soc_init(uint8_t dbi_mode)
{
    uint32_t reg;

    /* Enable the legacy PLL post-divider as well as the MM-domain 160 MHz
     * clock gate. Keeping both paths enabled avoids depending on boot-ROM
     * clock state. */
    reg = BL_RD_REG(MM_GLB_BASE, MM_GLB_CLKIP_POSTDIV);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_CLKPLL_EN_160M_CLK);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_CLKIP_POSTDIV, reg);

    reg = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG3);
    reg = BL_SET_REG_BIT(reg, GLB_CGEN_MM_WIFIPLL_160M);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG3, reg);

    /* Select WIFIPLL 160 MHz (selector value 0) for mm_muxpll_160m. */
    reg = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);
    reg = BL_CLR_REG_BIT(reg, GLB_REG_MM_MUXPLL_160M_SEL);
    BL_WR_REG(GLB_BASE, GLB_DIG_CLK_CFG1, reg);

    /* DBI is in the multimedia clock/reset domain. */
    reg = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_PLL_EN);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_CPU_CLK_EN);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_BCLK_EN);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_MM_CPU_CLK_EN);
    reg = BL_SET_REG_BIT(reg, MM_GLB_REG_MMCPU0_CLK_EN);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, reg);

    __asm__ volatile("fence iorw, iorw" ::: "memory");

    /* DBI shares the MIPI/display reset line. Pulsing it also recovers a DBI
     * instance left busy by an earlier failed transfer. */
    GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_MIPI);

    if (dbi_mode != DBI_MODE_TYPE_B) {
        /* Route the GPIO function-23 (DBI Type C) group to Type C pads. */
        reg = BL_RD_REG(GLB_BASE, GLB_PARM_CFG0);
        reg = BL_SET_REG_BIT(reg, GLB_REG_SEL_DBI_TYPE_C);
        BL_WR_REG(GLB_BASE, GLB_PARM_CFG0, reg);
    }
}
#endif /* defined(BL808) */

/* The memory space of DMA */
static struct bflb_dma_channel_lli_pool_s dma_tx_llipool[LCD_DBI_DMA_LLI_NUM];
static struct bflb_dma_channel_lli_transfer_s dma_tx_transfers[1];

static volatile bool dbi_async_flag = false;
static volatile bool dbi_async_cycle_fill_flag = false;

static void dbi_tc_callback(int irq, void *arg)
{
    /* disable dbi dma */
    bflb_dbi_link_txdma(dbi_hd, false);

    /* clear flag and mask int */
    bflb_dbi_int_clear(dbi_hd, DBI_INTCLR_TC);
    bflb_dbi_tcint_mask(dbi_hd, true);

    if (dbi_async_flag == false && dbi_async_cycle_fill_flag == false) {
        return;
    }

    if (dbi_async_cycle_fill_flag == true) {
        /* enable dma addr increment */
        bflb_dma_feature_control(dbi_dma_hd, DMA_CMD_SET_SRCADDR_INCREMENT, true);
    }

    /* disable DMA request for dbi */
    bflb_dbi_link_txdma(dbi_hd, false);

    dbi_async_flag = false;
    dbi_async_cycle_fill_flag = false;

    /* async callback */
    if (dbi_async_callback_en_flag && dbi_async_callback != NULL) {
        dbi_async_callback();
    }
}

int lcd_dbi_async_callback_register(void (*callback)(void))
{
    dbi_async_callback = callback;
    return 0;
}

int lcd_dbi_async_callback_enable(bool enable)
{
    dbi_async_callback_en_flag = enable;
    return 0;
}

int lcd_dbi_init(lcd_dbi_init_t *dbi_parra)
{
    /* dbi cfg */
    struct bflb_dbi_config_s dbi_cfg = {
        .clk_mode = DBI_CLOCK_MODE_1,
        .clk_freq_hz = dbi_parra->clock_freq,
        .tx_fifo_threshold = 3,
#if (LCD_DBI_WORK_MODE == 4)
        .cmd_wire_mode = dbi_parra->cmd_wire_dual_en,
        .addr_wire_mode = dbi_parra->addr_wire_dual_en,
        .data_wire_mode = dbi_parra->data_wire_dual_en,
#endif
    };

    /* dma cfg */
    struct bflb_dma_channel_config_s dma_dbi_config = {
        .direction = DMA_MEMORY_TO_PERIPH,
        .src_req = DMA_REQUEST_NONE,
        .dst_req = DMA_REQUEST_DBI_TX,
        .src_addr_inc = DMA_ADDR_INCREMENT_ENABLE,
        .dst_addr_inc = DMA_ADDR_INCREMENT_DISABLE,
        .src_burst_count = DMA_BURST_INCR4,
        .dst_burst_count = DMA_BURST_INCR4,
        .src_width = DMA_DATA_WIDTH_32BIT,
        .dst_width = DMA_DATA_WIDTH_32BIT,
    };

#if (LCD_DBI_WORK_MODE == 1)
    /* dbi typeC 4-wire mode */
    dbi_cfg.dbi_mode = DBI_MODE_TYPE_C_4_WIRE;
#elif (LCD_DBI_WORK_MODE == 2)
    /* dbi typeC 3-wire mode */
    dbi_cfg.dbi_mode = DBI_MODE_TYPE_C_3_WIRE;

#elif (LCD_DBI_WORK_MODE == 3)
    /* dbi typeB x8 mode */
    dbi_cfg.dbi_mode = DBI_MODE_TYPE_B;

#elif (LCD_DBI_WORK_MODE == 4)
    /* dbi Ex QSPI */
    dbi_cfg.dbi_mode = DBI_MODE_EX_QSPI;
#endif

    if (dbi_parra->pixel_format == LCD_DBI_LCD_PIXEL_FORMAT_RGB565) {
        if (LCD_RGB_ORDER_MODE) {
            dbi_cfg.pixel_input_format = DBI_PIXEL_INPUT_FORMAT_BGR_565;
        } else {
            dbi_cfg.pixel_input_format = DBI_PIXEL_INPUT_FORMAT_RGB_565;
        }
        dbi_cfg.pixel_output_format = DBI_PIXEL_OUTPUT_FORMAT_RGB_565;
    } else if (dbi_parra->pixel_format == LCD_DBI_LCD_PIXEL_FORMAT_NRGB8888) {
        if (LCD_RGB_ORDER_MODE) {
            dbi_cfg.pixel_input_format = DBI_PIXEL_INPUT_FORMAT_NBGR_8888;
        } else {
            dbi_cfg.pixel_input_format = DBI_PIXEL_INPUT_FORMAT_NRGB_8888;
        }
        dbi_cfg.pixel_output_format = DBI_PIXEL_OUTPUT_FORMAT_RGB_888;
    }

    /* gpio init */
    void LCD_DBI_GPIO_INIT_FUNC(void);
    LCD_DBI_GPIO_INIT_FUNC();

    /* get dma dev */
    dbi_dma_hd = bflb_device_get_by_name(LCD_DBI_DMA_NAME);
#if defined(BL616L)
    if (dbi_dma_hd->sub_idx < 6) {
        /* ch0~ch1: 64Byte, ch2~ch5: 32Byte, ch6~ch7: 16Byte */
        dbi_cfg.tx_fifo_threshold = 7;
        dma_dbi_config.src_burst_count = DMA_BURST_INCR8;
        dma_dbi_config.dst_burst_count = DMA_BURST_INCR8;
    }
#endif

    /* clock frequency limit */
    if (dbi_cfg.clk_freq_hz > LCD_DBI_CLOCK_LIMIT) {
        dbi_cfg.clk_freq_hz = LCD_DBI_CLOCK_LIMIT;
    }

    /* dbi init */
    dbi_hd = bflb_device_get_by_name("dbi");
#if defined(BL808)
    bl808_dbi_soc_init(dbi_cfg.dbi_mode);
#endif
    bflb_dbi_init(dbi_hd, &dbi_cfg);
    /* cs continuous mode */
    bflb_dbi_feature_control(dbi_hd, DBI_CMD_CS_CONTINUE, true);

    /* dbi tx intertupt init */
    bflb_dbi_tcint_mask(dbi_hd, true);
    bflb_irq_attach(dbi_hd->irq_num, dbi_tc_callback, NULL);
    bflb_irq_enable(dbi_hd->irq_num);

    /* dma init */
    bflb_dma_channel_init(dbi_dma_hd, &dma_dbi_config);
    return 0;
}

#if (LCD_DBI_WORK_MODE == 4)
int lcd_dbi_ex_qspi_addr_cfg(uint8_t addr_byte_size, uint32_t addr_val)
{
    bflb_dbi_qspi_set_addr(dbi_hd, addr_byte_size, addr_val);
    return 0;
}
#endif

int lcd_dbi_is_busy(void)
{
    if (dbi_async_flag || dbi_async_cycle_fill_flag) {
        return 1;
    } else {
        return 0;
    }
}

int lcd_dbi_transmit_cmd_para(uint8_t cmd, uint32_t *para, size_t para_num)
{
    bflb_dbi_send_cmd_data(dbi_hd, cmd, para_num, (void *)para);

    return 0;
}

int lcd_dbi_transmit_cmd_pixel_sync(uint8_t cmd, uint32_t *pixel, size_t pixel_num)
{
    bflb_dbi_send_cmd_pixel(dbi_hd, cmd, pixel_num, (void *)pixel);

    return 0;
}

int lcd_dbi_transmit_cmd_pixel_async(uint8_t cmd, uint32_t *pixel, size_t pixel_num)
{
    uint32_t data_size;

    dbi_async_flag = true;

    /* get data size */
    data_size = bflb_dbi_feature_control(dbi_hd, DBI_CMD_GET_SIZE_OF_PIXEL_CNT, pixel_num);

    /* dma transfers cfg */
    dma_tx_transfers[0].src_addr = (uint32_t)pixel;
    dma_tx_transfers[0].dst_addr = DMA_ADDR_DBI_TDR;
    dma_tx_transfers[0].nbytes = data_size;
    bflb_dma_channel_lli_reload(dbi_dma_hd, dma_tx_llipool, LCD_DBI_DMA_LLI_NUM, dma_tx_transfers, 1);

    /* clean cache */
    bflb_l1c_dcache_clean_range((void *)pixel, data_size);

    /* trigger dbi data transfer */
    bflb_dbi_send_cmd_pixel(dbi_hd, cmd, pixel_num, NULL);

    /* unmask int */
    bflb_dbi_tcint_mask(dbi_hd, false);

    /* enabled DMA request for dbi */
    bflb_dbi_link_txdma(dbi_hd, true);

    /* enable dma */
    bflb_dma_channel_start(dbi_dma_hd);

    return 0;
}

int lcd_dbi_transmit_cmd_pixel_fill_sync(uint8_t cmd, uint32_t pixel_val, size_t pixel_num)
{
    uint32_t words_cnt;
    uint8_t fifo_cnt;

    /* get data size */
    words_cnt = bflb_dbi_feature_control(dbi_hd, DBI_CMD_GET_SIZE_OF_PIXEL_CNT, pixel_num) / 4;

    /* trigger dbi data transfer */
    bflb_dbi_send_cmd_pixel(dbi_hd, cmd, pixel_num, NULL);

    /* fill data into fifo */
    for (; words_cnt > 0;) {
        fifo_cnt = bflb_dbi_feature_control(dbi_hd, DBI_CMD_GET_TX_FIFO_CNT, 0);
        fifo_cnt = words_cnt > fifo_cnt ? fifo_cnt : words_cnt;
        words_cnt -= fifo_cnt;

        for (; fifo_cnt > 0; fifo_cnt--) {
            putreg32(pixel_val, DMA_ADDR_DBI_TDR);
        }
    }

    /* wait transfer complete */
    while ((bflb_dbi_get_intstatus(dbi_hd) & DBI_INTSTS_TC) == 0) {};

    /* clear end flag */
    bflb_dbi_int_clear(dbi_hd, DBI_INTCLR_TC);

    return 0;
}

int lcd_dbi_transmit_cmd_pixel_fill_async(uint8_t cmd, uint32_t pixel_val, size_t pixel_num)
{
    uint32_t data_size;

    dbi_async_cycle_fill_flag = true;

    /* get data size */
    data_size = bflb_dbi_feature_control(dbi_hd, DBI_CMD_GET_SIZE_OF_PIXEL_CNT, pixel_num);

    /* dma cycle fill mode */
    bflb_dma_feature_control(dbi_dma_hd, DMA_CMD_SET_SRCADDR_INCREMENT, false);

    /* dma transfers cfg */
    dma_tx_transfers[0].src_addr = (uint32_t)&pixel_val;
    dma_tx_transfers[0].dst_addr = DMA_ADDR_DBI_TDR;
    dma_tx_transfers[0].nbytes = data_size;
    bflb_dma_channel_lli_reload(dbi_dma_hd, dma_tx_llipool, LCD_DBI_DMA_LLI_NUM, dma_tx_transfers, 1);

    /* clean cache */
    bflb_l1c_dcache_clean_range((void *)&pixel_val, sizeof(pixel_val));

    /* trigger dbi data transfer */
    bflb_dbi_send_cmd_pixel(dbi_hd, cmd, pixel_num, NULL);

    /* unmask int */
    bflb_dbi_tcint_mask(dbi_hd, false);

    /* enabled DMA request for dbi */
    bflb_dbi_link_txdma(dbi_hd, true);

    /* enable dma */
    bflb_dma_channel_start(dbi_dma_hd);

    return 0;
}

#else
#endif

#endif
